
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Clover_title" = "Clover EFI";
"Clover_description" = "Clover EFI membutuhkan tiga file utama. (dalam istilah yang sederhana)
boot0 (pada sektor MBR) berfungsi untuk memuat boot1.
boot1 (di bootsector partisi) berfungsi untuk mencari boot2.
boot2 (di partisi direktori root) berfungsi untuk memuat /EFI/BOOT/CLOVERIA32.efi atau CLOVERX64.efi, kernel dll.";

"boot0_title" = "1. BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Untuk BIOS booting pada motherboard BIOS.
Gunakan fdisk440 untuk menginstal boot0 ke 440 bits pertama dari MBR tanpa merusak Windows instalasi (kalau ada), kemudian boot0 akan mencari boot1h2 di partisi aktif pertama dalam partisi HFS, atau mencari boot1f32alt didalam partisi aktif pertama Fat32.
Modus ini akan mengaktifkan HFS + Fat32 yang terpilih.
Dibutuhkan untuk memformat partisi dalam format Fat32 pada Win atau Mac seperti berikut.
  1. Pakai Disk Utility untuk memformat dalam format MS-DOS (FAT).
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0hfs_title" = "1. BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Untuk BIOS booting pada motherboard BIOS.
Gunakan fdisk440 untuk menginstal boot0hfs ke 440 bits pertama dari MBR tanpa merusak Windows instalasi (kalau ada), kemudian boot0hfs akan mencari boot1h2 di partisi aktif pertama dalam partisi HFS, atau mencari boot1f32alt didalam partisi aktif pertama Fat32.
Modus ini tidak mengaktifkan partisi HFS yang terpilih, tapi akan mengaktifkan partisi Fat32 yang terpilih.
Dibutuhkan untuk memformat partisi dalam format Fat32 pada Win atau Mac seperti berikut.
  1. Pakai Disk Utility untuk memformat dalam format MS-DOS (FAT).
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0EFI_title" = "1. BIOS GPT EFI (HFS+Fat32)";
"boot0EFI_description" = "Untuk BIOS booting pada motherboard BIOS.
Gunakan fdisk440 untuk menginstal boot0hfs ke 440 bits pertama dari MBR tanpa merusak Windows instalasi (kalau ada), kemudian boot0hfs akan mencari boot1h2 atau boot1f32alt didalam partisi GPT EFI pertama.
Modus ini tidak mengaktifkan partisi yang terpilih.
Dibutuhkan untuk memformat EFI partisi dalam format HFS didalam Mac terlebih dahulu, diikuti perintah berikut.
  diskutil list
  newfs_hfs -v EFI /dev/rdisk9s1
Atau format EFI dalam format Fat32 didalam Mac terlebih dahulu, diikuti perintah berikut.
  diskutil list
  newfs_msdos -v EFI -F 32 /dev/rdisk9s1";

"boot1no_title" = "1. Unpack Saja";
"boot1no_description" = "Untuk BIOS booting pada motherboard BIOS.
Tanpa menginstal boot0 , boot0hfs, boot0md, boot1h2, dan boot1f32alt, dipakai untuk instalasi manual pada harddisk dengan bootsector 4kb.";

"boot1UEFI_title" = "1. UEFI boot (untuk motherboard UEFI)";
"boot1UEFI_description" = "Untuk UEFI booting pada motherboard UEFI.
Jangan instal boot0 , boot0hfs, boot0md, boot1h2, dan boot1f32alt.
Modus ini akan menginstal driver-driver ke /EFI/drivers32 dan /EFI/drivers64 yang dibutuhkan untuk UEFI booting.
Dibutuhkan pengaturan boot pada UEFI agar dapat memboot clover secara langsung dari UEFI:
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "2. Instal & Menjalankan mode 32bit terlebih dahulu";
"boot32_description" = "Menginstal file-file boot dan mengaktifkan mode 32bit.
Boot utama = Clover EFI 32bit. Anda dapat..
Tekan 1 untuk menjalankan boot1 = Chameleon boot,
Tekan 3 untuk menjalankan boot3 = Clover EFI 32bit boot,
Tekan 6 untuk menjalankan boot6 = Clover EFI 64bit boot.";

"boot64_title" = "2. Instal & Menjalankan mode 64bit terlebih dahulu";
"boot64_description" = "Menginstal file-file boot dan mengaktifkan mode 64bit.
Boot utama = Clover EFI 64bit. Anda dapat..
Tekan 1 untuk menjalankan boot1 = Chameleon boot,
Tekan 3 untuk menjalankan boot3 = Clover EFI 32bit boot,
Tekan 6 untuk menjalankan boot6 = Clover EFI 64bit boot.";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Tematis GUI";
"Themes_description" = "Pilih tema yang mau dipakai untuk GUI.";

"black_green_title" = "black_green";
"black_green_description" = "Tema Black_green kreasi Blackosx,
Pasang ke /EFI/BOOT/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme kreasi Eps,
Pasang ke /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme kreasi mrengles,
Pasang ke /EFI/BOOT/themes/mrengles.";

"iClover_title" = "iClover";
"iClover_description" = "Grey style theme by winlog,
Pasang ke /EFI/BOOT/themes/iClover.";

"buttons_title" = "buttons";
"buttons_description" = "Tema Buttons kreasi Trauma,
Pasang ke /EFI/BOOT/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Tema Hellfire kreasi illevelll,
Pasang ke /EFI/BOOT/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "Tema Original metal kreasi Slice,
Pasang ke /EFI/BOOT/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Tema Simple_gray kreasi hijeane,
Pasang ke /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Tema Wooden kreasi iROOTa,
Pasang ke /EFI/BOOT/themes/wooden.";

// ----------------------------------------------------------------------------